Repository: wwsh123/XrayUI
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: zh_cn

# Personalize_ImportBtn.Content
source: Import
zh_cn: 导入

# Personalize_ImportMenuRestore.Text
source: Restore from Backup
zh_cn: 恢复配置备份

# Personalize_ImportMenuClash.Text
source: Import Clash Config
zh_cn: 导入 Clash 配置

# Personalize_ClashImportSuccess
source: Clash config imported
zh_cn: Clash 配置导入成功

# Personalize_ClashImportSuccessMsg
source: Imported {0} node(s), skipped {1} unsupported.
zh_cn: 已导入 {0} 个节点，跳过 {1} 个不支持的节点。

# Personalize_ClashImportNoNodesTitle
source: No nodes imported
zh_cn: 未导入任何节点

# Personalize_ClashImportNoNodesMsg
source: No importable nodes found in this file (all unsupported protocols, or not a valid Clash config).
zh_cn: 该文件中没有可导入的节点（可能都是不支持的协议，或不是有效的 Clash 配置）。

# Personalize_ClashImportFailed
source: Clash import failed
zh_cn: Clash 配置导入失败

# Personalize_ImportBlockedTitle
source: Stop the proxy first
zh_cn: 请先停止代理

# Personalize_ImportBlockedMsg
source: Importing reloads the server list. Please disconnect before importing.
zh_cn: 导入会重新加载节点列表,请先断开当前连接后再导入。

# Personalize_ExportTooltip
source: Export preset configuration
zh_cn: 导出预置配置

# Personalize_ImportTooltip
source: Import preset configuration
zh_cn: 导入预置配置

# Personalize_ExportSuccessMsgFmt
source: Exported to {0}
zh_cn: 已导出至 {0}

# Personalize_ImportFailed
source: Import failed
zh_cn: 导入失败

# Personalize_ImportSuccess
source: Import successful
zh_cn: 导入成功

# Personalize_ImportSuccessMsg
source: Imported {0} nodes, {1} subscriptions, {2} rules{3}.
zh_cn: 已导入 {0} 个节点、{1} 条订阅、{2} 条规则{3}。

# Personalize_ImportAdvancedSuffix
source: , including advanced routing
zh_cn: 、含高级路由

# Personalize_PresetMissingTitle
source: Preset files not found
zh_cn: 未找到预置文件

# Personalize_PresetMissingMsg
source: Please prepare servers.json / settings.json under the Import folder first.
zh_cn: 请先准备 Import 文件夹下的 servers.json / settings.json。

# ChainProxy_NameLabel.Text
source: Name
zh_cn: 名称

# ChainProxy_NameBox.PlaceholderText
source: Chain proxy name
zh_cn: 链式代理名称

# ChainProxy_EntryLabel.Text
source: Entry proxy
zh_cn: 入口代理

# ChainProxy_EntryBox.PlaceholderText
source: Select front node
zh_cn: 选择前置节点

# ChainProxy_ExitLabel.Text
source: Exit proxy
zh_cn: 出口代理

# ChainProxy_ExitBox.PlaceholderText
source: Select exit node
zh_cn: 选择落地节点

# ChainProxy_Hint.Text
source: Traffic is forwarded through the entry proxy and routed out via the exit proxy
zh_cn: 流量经入口代理转发，再由出口代理出站

# ChainProxy_NameRequired
source: Please enter a chain proxy name.
zh_cn: 请输入链式代理名称。

# ChainProxy_EntryRequired
source: Please select an entry proxy.
zh_cn: 请选择入口代理。

# ChainProxy_ExitRequired
source: Please select an exit proxy.
zh_cn: 请选择出口代理。

# ChainProxy_EntryExitSame
source: Entry proxy and exit proxy cannot be the same node.
zh_cn: 入口代理和出口代理不能是同一个节点。

# Tun_MoreOptionsBtn.Content
source: More options
zh_cn: 更多选项

# Tun_MtuLabel.Text
source: Maximum transmission unit
zh_cn: 最大传输单元

# Tun_InterfaceLabel.Text
source: Outbound interface
zh_cn: 出口网卡

# Tun_InterfaceTooltip
source: Xray picks automatically by default; only set this manually if auto mode is unavailable.
zh_cn: 默认使用 Xray 自动选择；只有自动模式不可用时才手动指定。

# Tun_AutoInterfaceLabel
source: auto (recommended)
zh_cn: auto（推荐）

# Tun_Ipv6Label.Text
source: Enable IPv6 address
zh_cn: 开启IPv6

# Subscription_DialogTitle_Add
source: Add Subscription
zh_cn: 添加订阅

# Subscription_DialogTitle_Manage
source: Manage Subscriptions
zh_cn: 管理订阅

# Subscription_UrlBox.Header
source: Subscription URL
zh_cn: 订阅链接

# Subscription_NameBox.Header
source: Name (optional)
zh_cn: 备注名称（可选）

# Subscription_NameBox.PlaceholderText
source: Leave empty to use link domain
zh_cn: 留空则使用链接域名

# Subscription_AutoRefreshBox.Header
source: Auto update
zh_cn: 自动更新

# Subscription_AutoRefreshOff.Content
source: Off
zh_cn: 关闭

# Subscription_AutoRefresh1Hour.Content
source: Every 1 hour
zh_cn: 每 1 小时

# Subscription_AutoRefresh6Hours.Content
source: Every 6 hours
zh_cn: 每 6 小时

# Subscription_AutoRefresh12Hours.Content
source: Every 12 hours
zh_cn: 每 12 小时

# Subscription_AutoRefresh24Hours.Content
source: Every 24 hours
zh_cn: 每 24 小时

# Subscription_AutoImportHintText.Text
source: Auto-parsing and importing subscription nodes.
zh_cn: 将自动解析并导入该订阅中的全部节点

# Subscription_EmptyText.Text
source: No subscriptions
zh_cn: 暂无订阅

# Subscription_DeleteConfirmText.Text
source: Delete subscription?
zh_cn: 删除订阅？

# Subscription_DeleteDescText.Text
source: All nodes under this subscription will also be deleted.
zh_cn: 将同时删除该订阅下的所有节点。

# Subscription_DeleteConfirmBtn.Content
source: Delete
zh_cn: 删除

# Subscription_SaveBtn.Content
source: Save
zh_cn: 保存

# Xray_ExeNotFound
source: Could not find xray.exe Path: {0}
zh_cn: 找不到 xray.exe 路径：{0}

# Xray_ExitedImmediately
source: xray exited immediately (exit code {0})
zh_cn: xray 立即退出（退出码 {0}）

# XrayLog_Started
source: [Started] {0}
zh_cn: [启动] {0}

# XrayLog_Config
source: [Config] {0}
zh_cn: [配置] {0}

# XrayLog_Error
source: [Error] {0}
zh_cn: [错误] {0}

# XrayLog_StartFailed
source: [Error] Start failed: {0}
zh_cn: [错误] 启动失败：{0}

# XrayLog_Exception
source: [Exception] {0}
zh_cn: [异常] {0}

# XrayLog_Stopped
source: [Stopped]
zh_cn: [已停止]

# XrayLog_Shutdown
source: [shutdown] xray stopped
zh_cn: [关机] xray 已停止

# XrayLog_ProcessExited
source: [xray process exited]
zh_cn: [xray 进程已退出]

# XrayLog_JobCreateFailed
source: [Warning] CreateJobObject failed (err={0}); orphan-process safety net disabled
zh_cn: [警告] CreateJobObject 失败 (err={0})，孤儿进程兜底已禁用

# XrayLog_JobAssignFailed
source: [Warning] AssignProcessToJobObject failed (err={0}); orphan-process safety net inactive
zh_cn: [警告] AssignProcessToJobObject 失败 (err={0})，孤儿进程兜底未生效

# XrayLog_JobBindException
source: [Warning] Job Object bind exception: {0}
zh_cn: [警告] Job Object 绑定异常：{0}

# Chain_NeedServerList
source: Chain proxy needs the server list to resolve entry/exit nodes.
zh_cn: 链式代理需要服务器列表才能解析入口和出口节点。

# Chain_EndpointMissing
source: The chain proxy's entry or exit node no longer exists. Please edit the chain proxy again.
zh_cn: 链式代理引用的入口或出口节点不存在，请重新编辑该链式代理。

# Chain_NoNesting
source: A chain proxy cannot nest another chain proxy. Please choose different entry/exit nodes.
zh_cn: 链式代理不能嵌套链式代理，请重新选择入口和出口节点。

# Tun_PreflightErrorTitle
source: TUN mode error
zh_cn: TUN 模式错误

# Tun_WintunNotFound
source: Could not find wintun.dll Path: {0}
zh_cn: 找不到 wintun.dll 路径：{0}

# ServerList_TestModeConnect.Text
source: Tcping Latency
zh_cn: Tcping延迟

# ServerList_TestModeReal.Text
source: Real Connection Latency
zh_cn: 真连接延迟

# Personalize_RoutingRegionTitle.Text
source: Region
zh_cn: 区域设置

# Personalize_LanguageRegionExpanderAutomationName
source: Application language and region settings
zh_cn: 应用语言和区域设置

# Personalize_Region_CN.Content
source: China
zh_cn: 中国

# Personalize_Region_RU.Content
source: Russia
zh_cn: 俄罗斯

# Personalize_Region_IR.Content
source: Iran
zh_cn: 伊朗

# Personalize_RoutingRegionDesc.Text
source: Region routed setting
zh_cn: 选择智能路由的国家或地区

# Personalize_HotkeyDialogClear
source: Clear shortcut
zh_cn: 清除快捷键

# Personalize_HotkeyRecorderPlaceholder
source: Press a key combination…
zh_cn: 请按下组合键…

# HotkeyRecorder_Instruction.Text
source: Click the box below, then press the combination you want
zh_cn: 点击下方区域，然后按下想要绑定的组合键

# Subscription_WaitingForNetwork
source: No network connection. Refresh will resume when the network is available.
zh_cn: 网络未连接。网络恢复后将继续更新。

# Subscription_CheckUrl
source: Check the subscription link and your access with the provider.
zh_cn: 请检查订阅链接及服务商账户权限。

# Traffic_Title.Text
source: Traffic
zh_cn: 流量监控

# Traffic_OpenTooltip
source: Traffic
zh_cn: 流量

# Traffic_Pause.Content
source: Pause
zh_cn: 暂停

# Traffic_Clear.Content
source: Clear
zh_cn: 清空

# Traffic_Download.Text
source: Download
zh_cn: 下载

# Traffic_Upload.Text
source: Upload
zh_cn: 上传

# Traffic_Volume.Text
source: Observed traffic
zh_cn: 已观测流量

# Traffic_AccessCount.Text
source: Access events
zh_cn: 访问次数

# Traffic_ChartTitle.Text
source: Transfer speed
zh_cn: 传输速率

# Traffic_ChartAccessibleName
source: Transfer speed
zh_cn: 传输速率

# Traffic_ChartEmpty.Text
source: Waiting for traffic measurements
zh_cn: 等待流量数据

# Traffic_LatestSample.Text
source: Latest sample
zh_cn: 最新采样

# Traffic_Range
source: −{0} min
zh_cn: −{0} 分钟

# Traffic_FiveMinutes.Content
source: 5 minutes
zh_cn: 5 分钟

# Traffic_FifteenMinutes.Content
source: 15 minutes
zh_cn: 15 分钟

# Traffic_Search.PlaceholderText
source: Search address or application
zh_cn: 搜索地址或应用

# Traffic_SearchAutomationName
source: Search traffic
zh_cn: 搜索流量

# Traffic_FilterAutomationName
source: Filter route
zh_cn: 筛选路由

# Traffic_WindowAutomationName
source: Chart time range
zh_cn: 图表时间范围

# Traffic_SortAutomationName
source: Sort accesses
zh_cn: 排序访问记录

# Traffic_AllRoutes.Content
source: All routes
zh_cn: 所有路由

# Traffic_Proxy.Content
source: Proxy
zh_cn: 代理

# Traffic_Direct.Content
source: Direct
zh_cn: 直连

# Traffic_Blocked.Content
source: Blocked
zh_cn: 拦截

# Traffic_Newest.Content
source: Newest first
zh_cn: 最新优先

# Traffic_ByAddress.Content
source: By address
zh_cn: 按地址

# Traffic_Details.Content
source: Details
zh_cn: 详情

# Traffic_Time.Text
source: Time
zh_cn: 时间

# Traffic_Destination.Text
source: Destination / source
zh_cn: 目标 / 来源

# Traffic_Route.Text
source: Route
zh_cn: 路由

# Traffic_DetailsTitle
source: Access details
zh_cn: 访问详情

# Traffic_CopyAddress
source: Copy destination
zh_cn: 复制目标地址

# Traffic_Close
source: Close
zh_cn: 关闭

# Traffic_RowCount
source: {0} shown · {1} collected · {2} older events discarded
zh_cn: 显示 {0} 条 · 已收集 {1} 条 · 已淘汰 {2} 条旧记录

# Traffic_RouteUnknown
source: Unknown
zh_cn: 未知

# Traffic_RouteProxy
source: Proxy
zh_cn: 代理

# Traffic_RouteDirect
source: Direct
zh_cn: 直连

# Traffic_RouteBlocked
source: Blocked
zh_cn: 拦截

# Traffic_UnknownApplication
source: Application unavailable
zh_cn: 无法获取应用信息

# Traffic_Paused
source: Display paused · collection is unaffected
zh_cn: 显示已暂停 · 不影响采集

# Traffic_SourcePending
source: Traffic collection is not connected yet
zh_cn: 流量采集尚未接入

# Traffic_StatusStopped
source: Core stopped · history retained
zh_cn: 核心已停止 · 历史记录已保留

# Traffic_StatusWaitingForSample
source: Waiting for the first measurement
zh_cn: 等待首次采样

# Traffic_StatusLive
source: Receiving measurements from Xray
zh_cn: 正在接收 Xray 数据

# Traffic_StatusUnavailable
source: Measurements unavailable · gaps are preserved
zh_cn: 数据不可用 · 保留采样间隙

# Traffic_EmptyPending
source: This page is ready. Addresses and graphs will appear after traffic collection is connected.
zh_cn: 页面已就绪。接入流量采集后将显示地址和图表。

# Traffic_EmptyFilter
source: No accesses match these filters.
zh_cn: 没有符合筛选条件的访问记录。

# Traffic_Empty
source: No access events yet. Only traffic handled by Xray appears here.
zh_cn: 暂无访问记录。此处仅显示经过 Xray 的流量。
